# Описание
"""
Selection sort е прост алгоритъм за сортиране, който използва два вложени цикъла.
При всяка итерация на външния цикъл алгоритъмът избира позиция в масива,
на която трябва да бъде поставен правилният елемент.
В рамките на вътрешния цикъл се търси най-малкият (или съответно най-големият)
елемент в несортираната част на масива. След като бъде намерен,
този елемент се разменя с елемента на индекса,
съответстващ на текущата итерация на външния цикъл.
"""

# Бързодействие
"""
- Най-добър, среден и най-лош случай - O(n²)
Това се дължи на факта, че винаги обхождаме масива с два вложени цикъла.
- Паметна сложност - O(1)
- Брой размени: максимум n−1
"""

# Приложения
"""
- Малки масиви
- Вградени системи със силно ограничена памет
- Когато търсим минимален брой на размените
"""

# Пример + обяснение
"""
Нека създадем масив [15, 4, 12, 28, 16]
1) Минимум → 4 → разменя се с 15
2) Минимум → 12 → разменя се с 15
3) Минимум → 15 → на мястото си е, не правим размяна
4) Минимум → 16 → разменя се с 28
Получен резултат: [4, 12, 15, 16, 28]
"""


# Имплементация
def selection_sort(arr):
    n = len(arr)
    for i in range(n):
        min_index = i
        for j in range(i + 1, n):
            if arr[j] < arr[min_index]:
                min_index = j
        arr[min_index], arr[i] = arr[i], arr[min_index]
    return arr


my_arr = [15, 4, 12, 28, 16]
sorted_arr = selection_sort(my_arr)
print(sorted_arr)
